src/org/content/dsql-auth.org
#+title: Aurora DSQL: How authentication and authorization works
#+setupfile: ../templates/level0.org
#+date: <2025-05-13 Tue>

* Aurora DSQL: How authentication and authorization works

In this article, I'm going to explain how connections to Aurora DSQL are
authenticated and authorized. This information is meant to be supplemental to
what is found in the official [[https://docs.aws.amazon.com/aurora-dsql/][Amazon Aurora DSQL]] documentation.

This is a "nuts and bolts" explanation, rather than a "how to" guide. After
reading this article you should understand:

- How PostgreSQL standard user-password authentication works
- The difference between an authentication token and a password
- How and when authentication tokens are generated
- How IAM is used by DSQL

If you are already familiar with Postgres or AWS authentication, I'm not sure
how much value you're going to get out of this post. However, I know that there
are many people out there who understand the Postgres piece, but no the AWS
piece or vice-versa. All the information is already out there, but to my
knowledge, there aren't many articles that really lay it all out end-to-end.
That's what I'm trying to do here.

** Authentication and authorization in Postgres: a recap

/Authentication/ is about establishing /who/ is connecting to the database.

Authentication is easy. My name is Marc. Now you know. That wasn't so hard, was
it? Well... do you really know? Why should you trust that I am who I say I am?

In the real world, we are asked to validate our identity all the time. If you
take a flight, you may be asked to display a driver's license or passport.
Authentication requires /verifying/ identity.

PostgreSQL has a number of [[https://www.postgresql.org/docs/current/auth-methods.html][Authentication methods]]:

- /Trust/ authentication, which simply trusts that users are who they say they are.
- /Password/ authentication, which requires that users send a password.
- .. and so on

These authentication methods are built into both Postgres clients and servers.
Not all authentication methods are supported by all clients or by all servers.

When a Postgres client connects to a Postgres cluster[fn:1], the following
messages are exchanged over the wire:

1. client -> server: My name is =$user= and I'd like to login to =$dbname=
2. server -> client: Sure, tell me your password
3. client -> server: ilikecats

No authentication model is fool proof - it's all about building confidence. In
this case, the server trusts that I'm in fact Marc because I told the server a
secret that I had previously shared with the server. And because nobody else
should know that secret, I am therefore me.

/Authorization/ is about establishing /what/ an authenticated user can do.
Authorization is often oriented around verbs or actions.

New connections always take a default action: =LOGIN=. If you create a
role[fn:2] like this:

#+begin_src sh
postgres=> CREATE ROLE test password '...';
#+end_src

Then you will not be able to login to the cluster. You need to authorize logins:

#+begin_src sh
postgres=> CREATE ROLE test WITH LOGIN password '...';
#+end_src

In Postgres, roles can have complex permissions such as which tables a role can
see or modify. When you run a SQL statement like =INSERT INTO my_table ..=,
there may be (surprisingly) many authorization checks which run to ensure you
can do everything you're trying to do.

** The trouble with passwords

In a normal Postgres installation, a cluster would be configured with a
"root"-like user (often called "master", "admin", "superuser", or similar) that
has permission to do anything. Then, the root user would be used to create
additional roles with scoped-down permissions (principal of least privilege).
Protecting the password of the "root" account is (especially) critical; if an
attacker learns that password then they too can do anything.

Unfortunately, keeping passwords secure is frustratingly difficult. It is all
too easy to accidentally log a password, include it in source control, in a
stack trace, or in a memory dump.

Imagine you're submitting a bug report online, and in the process of reporting
the bug you accidentally included your database password in the bug report. What
happens next? After one second, probably nothing. But it's only a matter of
time before a malicious actor finds the password and tries to use it.

One of the ways to mitigate this threat is to rotate passwords. Every so often
you change the password to something else. Let's say you rotate passwords every
week. If you leaked a password and it took a month for an attacker to find it,
then you're protected because the leaked password is no longer valid.

Building password rotation into your system is conceptually simple, but
practically non-trivial. You need to:

1. Have a place to store and distribute passwords so that clients can learn the
   current password.
2. Define a mechanism to rotate passwords. When does the server learn the new
   password? How and when do clients learn the new password?

This turns out to be a lot of work, which is why [[https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/rds-secrets-manager.html][Password management with Amazon
RDS and AWS Secrets Manager]] exists.

Unfortunately, rotating passwords once a week (or day) just isn't good enough.
Attackers are constantly trawling the Internet for password leaks. It may only
take a few seconds between leaking a password and it being discovered and
exploited.

This is where defense in depth comes in. A common practice in AWS is to limit
network access to the database, such as by using a private VPC subnet or by
using security group rules.

As previously mentioned, Postgres supports a number of other authentication
methods. If passwords are so problematic, why not try one of those? Well, the
problem isn't really with /passwords/. If you used /Certificate/ authentication,
you'd have the same fundamental problem: what happens if you leak the
certificate?

The real trouble is with the /lifetime/ that a password (or certificate, etc.)
is valid for. If you could rotate passwords every second, then that'd be great.
But, that turns out to be difficult to do in practice.

