generated/dsql-auth.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-05-23 Fri 17:43 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aurora DSQL: How authentication and authorization works</title>
<meta name="author" content="Marc Bowes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
</head>
<body>
<div id="content" class="h-full antialiased light">
<div id="outline-container-org88a216a" class="outline-2">
<h2 id="org88a216a">Aurora DSQL: How authentication and authorization works</h2>
<div class="outline-text-2" id="text-org88a216a">
<p>
In this article, I&rsquo;m going to explain how connections to Aurora DSQL are
authenticated and authorized. This information is meant to be supplemental to
what is found in the official <a href="https://docs.aws.amazon.com/aurora-dsql/">Amazon Aurora DSQL</a> documentation.
</p>

<p>
This is a &ldquo;nuts and bolts&rdquo; explanation, rather than a &ldquo;how to&rdquo; guide. After
reading this article you should understand:
</p>

<ul class="org-ul">
<li>How PostgreSQL standard user-password authentication works</li>
<li>The difference between an authentication token and a password</li>
<li>How and when authentication tokens are generated</li>
<li>How IAM is used by DSQL</li>
</ul>

<p>
If you are already familiar with Postgres or AWS authentication, I&rsquo;m not sure
how much value you&rsquo;re going to get out of this post. However, I know that there
are many people out there who understand the Postgres piece, but no the AWS
piece or vice-versa. All the information is already out there, but to my
knowledge, there aren&rsquo;t many articles that really lay it all out end-to-end.
That&rsquo;s what I&rsquo;m trying to do here.
</p>
</div>
<div id="outline-container-orgfe2e448" class="outline-3">
<h3 id="orgfe2e448">Authentication and authorization in Postgres: a recap</h3>
<div class="outline-text-3" id="text-orgfe2e448">
<p>
<i>Authentication</i> is about establishing <i>who</i> is connecting to the database.
</p>

<p>
Authentication is easy. My name is Marc. Now you know. That wasn&rsquo;t so hard, was
it? Well&#x2026; do you really know? Why should you trust that I am who I say I am?
</p>

<p>
In the real world, we are asked to validate our identity all the time. If you
take a flight, you may be asked to display a driver&rsquo;s license or passport.
Authentication requires <i>verifying</i> identity.
</p>

<p>
PostgreSQL has a number of <a href="https://www.postgresql.org/docs/current/auth-methods.html">Authentication methods</a>:
</p>

<ul class="org-ul">
<li><i>Trust</i> authentication, which simply trusts that users are who they say they are.</li>
<li><i>Password</i> authentication, which requires that users send a password.</li>
<li>.. and so on</li>
</ul>

<p>
These authentication methods are built into both Postgres clients and servers.
Not all authentication methods are supported by all clients or by all servers.
</p>

<p>
When a Postgres client connects to a Postgres cluster<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, the following
messages are exchanged over the wire:
</p>

<ol class="org-ol">
<li>client -&gt; server: My name is <code>$user</code> and I&rsquo;d like to login to <code>$dbname</code></li>
<li>server -&gt; client: Sure, tell me your password</li>
<li>client -&gt; server: ilikecats</li>
</ol>

<p>
No authentication model is fool proof - it&rsquo;s all about building confidence. In
this case, the server trusts that I&rsquo;m in fact Marc because I told the server a
secret that I had previously shared with the server. And because nobody else
should know that secret, I am therefore me.
</p>

<p>
<i>Authorization</i> is about establishing <i>what</i> an authenticated user can do.
Authorization is often oriented around verbs or actions.
</p>

<p>
New connections always take a default action: <code>LOGIN</code>. If you create a
role<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> like this:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">postgres</span>=&gt; CREATE ROLE test password <span style="color: #98be65;">'...'</span>;
</pre>
</div>

<p>
Then you will not be able to login to the cluster. You need to authorize logins:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">postgres</span>=&gt; CREATE ROLE test WITH LOGIN password <span style="color: #98be65;">'...'</span>;
</pre>
</div>

<p>
In Postgres, roles can have complex permissions such as which tables a role can
see or modify. When you run a SQL statement like <code>INSERT INTO my_table ..</code>,
there may be (surprisingly) many authorization checks which run to ensure you
can do everything you&rsquo;re trying to do.
</p>
</div>
</div>
<div id="outline-container-orge7c996d" class="outline-3">
<h3 id="orge7c996d">The trouble with passwords</h3>
<div class="outline-text-3" id="text-orge7c996d">
<p>
In a normal Postgres installation, a cluster would be configured with a
&ldquo;root&rdquo;-like user (often called &ldquo;master&rdquo;, &ldquo;admin&rdquo;, &ldquo;superuser&rdquo;, or similar) that
has permission to do anything. Then, the root user would be used to create
additional roles with scoped-down permissions (principal of least privilege).
Protecting the password of the &ldquo;root&rdquo; account is (especially) critical; if an
attacker learns that password then they too can do anything.
</p>

<p>
Unfortunately, keeping passwords secure is frustratingly difficult. It is all
too easy to accidentally log a password, include it in source control, in a
stack trace, or in a memory dump.
</p>

<p>
Imagine you&rsquo;re submitting a bug report online, and in the process of reporting
the bug you accidentally included your database password in the bug report. What
happens next? After one second, probably nothing. But it&rsquo;s only a matter of
time before a malicious actor finds the password and tries to use it.
</p>

<p>
One of the ways to mitigate this threat is to rotate passwords. Every so often
you change the password to something else. Let&rsquo;s say you rotate passwords every
week. If you leaked a password and it took a month for an attacker to find it,
then you&rsquo;re protected because the leaked password is no longer valid.
</p>

<p>
Building password rotation into your system is conceptually simple, but
practically non-trivial. You need to:
</p>

<ol class="org-ol">
<li>Have a place to store and distribute passwords so that clients can learn the
current password.</li>
<li>Define a mechanism to rotate passwords. When does the server learn the new
password? How and when do clients learn the new password?</li>
</ol>

<p>
This turns out to be a lot of work, which is why <a href="https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/rds-secrets-manager.html">Password management with Amazon
RDS and AWS Secrets Manager</a> exists.
</p>

<p>
Unfortunately, rotating passwords once a week (or day) just isn&rsquo;t good enough.
Attackers are constantly trawling the Internet for password leaks. It may only
take a few seconds between leaking a password and it being discovered and
exploited.
</p>

<p>
This is where defense in depth comes in. A common practice in AWS is to limit
network access to the database, such as by using a private VPC subnet or by
using security group rules.
</p>

<p>
As previously mentioned, Postgres supports a number of other authentication
methods. If passwords are so problematic, why not try one of those? Well, the
problem isn&rsquo;t really with <i>passwords</i>. If you used <i>Certificate</i> authentication,
you&rsquo;d have the same fundamental problem: what happens if you leak the
certificate?
</p>

<p>
The real trouble is with the <i>lifetime</i> that a password (or certificate, etc.)
is valid for. If you could rotate passwords every second, then that&rsquo;d be great.
But, that turns out to be difficult to do in practice.
</p>
</div>
</div>
