src/org/content/dsql-auth.org
** How do AWS services handle authentication and authorization?

#+begin_src sh
aws s3 ls
#+end_src

How does S3 know who you are? How does S3 know that you're allowed to call the
=ListBuckets= operation?

Let's unpack /authentication/ first. In order to do that, I need to explain how
AWS credentials work. Remember, authentication requires proof. Credentials are
how we're going to prove our identity.

Let's pretend we have some AWS credentials. We went to the IAM (Identity and
Access Management) console, made an IAM user and then downloaded credentials.
AWS credentials are similar to a username and password, but with different
names. =$AWS_ACCESS_KEY_ID= is the "username", =$AWS_SECRET_ACCESS_KEY= is the
"password". You should never share your secret key, in the same way that you
should never share your password. Secret keys are not actually passwords, we'll
get to that.

At this point I feel obliged to say: _Please don't use long-lived credentials._
Later, I'm going to explain what you should do instead, and why it's so much
better. But for now, let's roll with it, because we need to understand the
simple version first.

If you make a request to an AWS service, you're really making a Remote Procedure
Call (RPC) request over HTTPS. Try this out:

#+begin_src sh :results raw
aws --debug s3 ls 2>&1 | grep "http request"
#+end_src

What you'll see is a HTTPS =GET= request with some headers. One of those headers
is =Authorization=[fn:3]. Like Postgres, HTTPS also supports multiple kinds of
authentication. From Mozilla's documentation on [[https://developer.mozilla.org/en-US/docs/Web/HTTP/Guides/Authentication#authorization_and_proxy-authorization_headers][HTTP authentication]]:

#+begin_src
Authorization: <type> <credentials>
Proxy-Authorization: <type> <credentials>

Some common authentication schemes include:

Basic

    See RFC 7617, base64-encoded credentials. More information below.

< ... >
#+end_src

The way Basic /type/ works is you simply transmit your user-password in the
=Authorization= header. That's really simple, but not very secure. If anybody
intercepts the request, they have your password and can then make other requests
on your behalf. This is _absolutely not_ how AWS does it:

#+begin_src
GET /
Authentication: Basic $AWS_ACCESS_KEY_ID:$AWS_SECRET_ACCESS_KEY
#+end_src

We need to send something, and it can't be the secret key. What we want to do is
send something that proves we /have/ the key. This is where cryptography comes
in, and it's why secret keys aren't actually passwords. They're cryptographic
keys. Instead of transmitting the =$AWS_SECRET_ACCESS_KEY= in plain text, the
key is going to be used to /generate a signature/.

Imagine we have a request that looks like this[fn:4]:

#+begin_src
GET /
Host: s3.us-east-1.amazonaws.com
Foo: Bar

<body of the request />
#+end_src

The signing process is going to /alter/ the request to look like this:

#+begin_src
GET /
Host: s3.us-east-1.amazonaws.com
Authorization: AWS4-HMAC-SHA256 Credential=$AWS_ACCESS_KEY_ID/<etc>, SignedHeaders=Host, Signature=$SIGNATURE
Foo: Bar

<body of the request />
#+end_src

What's important to understand here is that:

1. The =$AWS_ACCESS_KEY_ID= /is/ transmitted
2. The =$AWS_ACCESS_SECRET_ACCESS_KEY= is not transmitted
3. Instead, a signature is sent

Signatures are a cryptographic concept that provide authenticity (you know who
signed the message) and integrity (you know that the message wasn't tampered
with).

What's cool about this is that if a request is intercepted as plaintext
(remember, HTTPS is being used), the /signature/ cannot be used to generate new
signatures; /you need the key/ to be able to generate signatures. This means
that you intercept a request to list objects in a S3 bucket, you cannot then
also download or delete objects. The only thing you can do with an intercepted
request is replay it (later, we'll see how that too has limited utility to an
attacker).

So how are signatures actually generated? It's right there in the =<type>=,
silly: AWS4-HMAC-SHA256. "AWS4" is short for "AWS Signature version 4", which is
an algorithm. [[https://en.wikipedia.org/wiki/HMAC][HMAC]] stands for Hash-based Message Authentication Code. And SHA256
is a cryptographic hash function. So... what is a MAC?

Imagine you're doing something really important. Like defusing a bomb (sorry).
And you're waiting for me to tell you which wire to cut. You get a text from an
unknown number: "cut the blue". You might, at this point, wonder what to do.

How do you know that the message came from me? And, if it did come from me, how
do you know it wasn't tampered with?

Turns out that you and I have a secret protocol. Whenever we text each other, we
count the number of characters in the message and add that to the end. "cut the
blue (12)". That might help with your confidence. For example, you're now more
confident that the message was not, in fact: "DO NOT cut the blue".

The problem with this protocol is that it doesn't really help you with your
other concerns. How do I know the baddy isn't texting me to get me to cut the
wrong wire and set the bomb off? Obviously, you need cryptography.

This is where Message Authentication Codes (the MAC part) come in. The H stands
for Hash-based. An HMAC is generated over the message and then transmitted with
the message. The receiver can then trust that the message came from somebody
with the shared secret (and hopefully the baddy doesn't have it) and that it
wasn't somehow altered en route. What's nice about HMACs is they're both fast
and produce a fixed length output.

The AWS Signature version 4 algorithm is a set of operations that involve HMACs.
The most important thing to understand is that critical HTTP headers and the
HTTP body is included in the calculation. As with our bomb defusal story, this
means that AWS services can validate the sender of the message and that the
message was not tampered with.

If you want to learn more about how AWS4 actually works, I recommend watching
[[https://www.youtube.com/watch?v=BpTpcUA_F2w][How AWS SIGv4 and SIGv4A work]].

I promised I'd explain replay attacks, so here we go. AWS requests include a
=x-amz-date= header[fn:5], and this header is included in the signature (which
means it cannot be tampered with). AWS services will refuse to process requests
where the date is too far from "now". This means that if a request is
intercepted, it can only be replayed within this window. An attacker cannot
change the date, because that would invalidate the signature. And, intercepting
plaintext requests in real time is quite difficult because of TLS. It may be
possible to grab ciphertext requests and eventually decrypt those, but by the
time you're done doing that the validity window will have lapsed.

At this point, you should have a good understanding of /authentication/. To
recap:

1. Your client is configured with AWS credentials
2. A HTTP request is produced (with headers and a body), but not sent
3. The request is /signed/, adding additional headers (importantly: a signature)
4. The request is transmitted over TLS to AWS (HTTPS)
5. AWS validates the request's signature
6. .. and in so doing knows who made the request

Next, /authorization/. I'm going to breeze through this one, since it's a
universe unto itself. For now, all you need to know is that the AWS service
will:

1. Lookup the policies for the authenticated caller
2. Look at the request
3. Evaluate whether the request should be allowed

This looks a whole lot like what Postgres does. When you run =DROP TABLE=,
Postgres is going to lookup your permissions, look at your SQL, and then
determine if you're allowed to do that or not.

