generated/dsql-auth.html
<div id="outline-container-org62e7017" class="outline-3">
<h3 id="org62e7017">How do AWS services handle authentication and authorization?</h3>
<div class="outline-text-3" id="text-org62e7017">
<div class="org-src-container">
<pre class="src src-sh">aws s3 <span style="color: #ECBE7B;">ls</span>
</pre>
</div>

<p>
How does S3 know who you are? How does S3 know that you&rsquo;re allowed to call the
<code>ListBuckets</code> operation?
</p>

<p>
Let&rsquo;s unpack <i>authentication</i> first. In order to do that, I need to explain how
AWS credentials work. Remember, authentication requires proof. Credentials are
how we&rsquo;re going to prove our identity.
</p>

<p>
Let&rsquo;s pretend we have some AWS credentials. We went to the IAM (Identity and
Access Management) console, made an IAM user and then downloaded credentials.
AWS credentials are similar to a username and password, but with different
names. <code>$AWS_ACCESS_KEY_ID</code> is the &ldquo;username&rdquo;, <code>$AWS_SECRET_ACCESS_KEY</code> is the
&ldquo;password&rdquo;. You should never share your secret key, in the same way that you
should never share your password. Secret keys are not actually passwords, we&rsquo;ll
get to that.
</p>

<p>
At this point I feel obliged to say: <span class="underline">Please don&rsquo;t use long-lived credentials.</span>
Later, I&rsquo;m going to explain what you should do instead, and why it&rsquo;s so much
better. But for now, let&rsquo;s roll with it, because we need to understand the
simple version first.
</p>

<p>
If you make a request to an AWS service, you&rsquo;re really making a Remote Procedure
Call (RPC) request over HTTPS. Try this out:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws --debug s3 <span style="color: #ECBE7B;">ls</span> <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span> | <span style="color: #ECBE7B;">grep</span> <span style="color: #98be65;">"http request"</span>
</pre>
</div>

<p>
What you&rsquo;ll see is a HTTPS <code>GET</code> request with some headers. One of those headers
is <code>Authorization</code><sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>. Like Postgres, HTTPS also supports multiple kinds of
authentication. From Mozilla&rsquo;s documentation on <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Guides/Authentication#authorization_and_proxy-authorization_headers">HTTP authentication</a>:
</p>

<div class="org-src-container">
<pre class="src src-nil">Authorization: &lt;type&gt; &lt;credentials&gt;
Proxy-Authorization: &lt;type&gt; &lt;credentials&gt;

Some common authentication schemes include:

Basic

    See RFC 7617, base64-encoded credentials. More information below.

&lt; ... &gt;
</pre>
</div>

<p>
The way Basic <i>type</i> works is you simply transmit your user-password in the
<code>Authorization</code> header. That&rsquo;s really simple, but not very secure. If anybody
intercepts the request, they have your password and can then make other requests
on your behalf. This is <span class="underline">absolutely not</span> how AWS does it:
</p>

<div class="org-src-container">
<pre class="src src-nil">GET /
Authentication: Basic $AWS_ACCESS_KEY_ID:$AWS_SECRET_ACCESS_KEY
</pre>
</div>

<p>
We need to send something, and it can&rsquo;t be the secret key. What we want to do is
send something that proves we <i>have</i> the key. This is where cryptography comes
in, and it&rsquo;s why secret keys aren&rsquo;t actually passwords. They&rsquo;re cryptographic
keys. Instead of transmitting the <code>$AWS_SECRET_ACCESS_KEY</code> in plain text, the
key is going to be used to <i>generate a signature</i>.
</p>

<p>
Imagine we have a request that looks like this<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-nil">GET /
Host: s3.us-east-1.amazonaws.com
Foo: Bar

&lt;body of the request /&gt;
</pre>
</div>

<p>
The signing process is going to <i>alter</i> the request to look like this:
</p>

<div class="org-src-container">
<pre class="src src-nil">GET /
Host: s3.us-east-1.amazonaws.com
Authorization: AWS4-HMAC-SHA256 Credential=$AWS_ACCESS_KEY_ID/&lt;etc&gt;, SignedHeaders=Host, Signature=$SIGNATURE
Foo: Bar

&lt;body of the request /&gt;
</pre>
</div>

<p>
What&rsquo;s important to understand here is that:
</p>

<ol class="org-ol">
<li>The <code>$AWS_ACCESS_KEY_ID</code> <i>is</i> transmitted</li>
<li>The <code>$AWS_ACCESS_SECRET_ACCESS_KEY</code> is not transmitted</li>
<li>Instead, a signature is sent</li>
</ol>

<p>
Signatures are a cryptographic concept that provide authenticity (you know who
signed the message) and integrity (you know that the message wasn&rsquo;t tampered
with).
</p>

<p>
What&rsquo;s cool about this is that if a request is intercepted as plaintext
(remember, HTTPS is being used), the <i>signature</i> cannot be used to generate new
signatures; <i>you need the key</i> to be able to generate signatures. This means
that you intercept a request to list objects in a S3 bucket, you cannot then
also download or delete objects. The only thing you can do with an intercepted
request is replay it (later, we&rsquo;ll see how that too has limited utility to an
attacker).
</p>

<p>
So how are signatures actually generated? It&rsquo;s right there in the <code>&lt;type&gt;</code>,
silly: AWS4-HMAC-SHA256. &ldquo;AWS4&rdquo; is short for &ldquo;AWS Signature version 4&rdquo;, which is
an algorithm. <a href="https://en.wikipedia.org/wiki/HMAC">HMAC</a> stands for Hash-based Message Authentication Code. And SHA256
is a cryptographic hash function. So&#x2026; what is a MAC?
</p>

<p>
Imagine you&rsquo;re doing something really important. Like defusing a bomb (sorry).
And you&rsquo;re waiting for me to tell you which wire to cut. You get a text from an
unknown number: &ldquo;cut the blue&rdquo;. You might, at this point, wonder what to do.
</p>

<p>
How do you know that the message came from me? And, if it did come from me, how
do you know it wasn&rsquo;t tampered with?
</p>

<p>
Turns out that you and I have a secret protocol. Whenever we text each other, we
count the number of characters in the message and add that to the end. &ldquo;cut the
blue (12)&rdquo;. That might help with your confidence. For example, you&rsquo;re now more
confident that the message was not, in fact: &ldquo;DO NOT cut the blue&rdquo;.
</p>

<p>
The problem with this protocol is that it doesn&rsquo;t really help you with your
other concerns. How do I know the baddy isn&rsquo;t texting me to get me to cut the
wrong wire and set the bomb off? Obviously, you need cryptography.
</p>

<p>
This is where Message Authentication Codes (the MAC part) come in. The H stands
for Hash-based. An HMAC is generated over the message and then transmitted with
the message. The receiver can then trust that the message came from somebody
with the shared secret (and hopefully the baddy doesn&rsquo;t have it) and that it
wasn&rsquo;t somehow altered en route. What&rsquo;s nice about HMACs is they&rsquo;re both fast
and produce a fixed length output.
</p>

<p>
The AWS Signature version 4 algorithm is a set of operations that involve HMACs.
The most important thing to understand is that critical HTTP headers and the
HTTP body is included in the calculation. As with our bomb defusal story, this
means that AWS services can validate the sender of the message and that the
message was not tampered with.
</p>

<p>
If you want to learn more about how AWS4 actually works, I recommend watching
<a href="https://www.youtube.com/watch?v=BpTpcUA_F2w">How AWS SIGv4 and SIGv4A work</a>.
</p>

<p>
I promised I&rsquo;d explain replay attacks, so here we go. AWS requests include a
<code>x-amz-date</code> header<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>, and this header is included in the signature (which
means it cannot be tampered with). AWS services will refuse to process requests
where the date is too far from &ldquo;now&rdquo;. This means that if a request is
intercepted, it can only be replayed within this window. An attacker cannot
change the date, because that would invalidate the signature. And, intercepting
plaintext requests in real time is quite difficult because of TLS. It may be
possible to grab ciphertext requests and eventually decrypt those, but by the
time you&rsquo;re done doing that the validity window will have lapsed.
</p>

<p>
At this point, you should have a good understanding of <i>authentication</i>. To
recap:
</p>

<ol class="org-ol">
<li>Your client is configured with AWS credentials</li>
<li>A HTTP request is produced (with headers and a body), but not sent</li>
<li>The request is <i>signed</i>, adding additional headers (importantly: a signature)</li>
<li>The request is transmitted over TLS to AWS (HTTPS)</li>
<li>AWS validates the request&rsquo;s signature</li>
<li>.. and in so doing knows who made the request</li>
</ol>

<p>
Next, <i>authorization</i>. I&rsquo;m going to breeze through this one, since it&rsquo;s a
universe unto itself. For now, all you need to know is that the AWS service
will:
</p>

<ol class="org-ol">
<li>Lookup the policies for the authenticated caller</li>
<li>Look at the request</li>
<li>Evaluate whether the request should be allowed</li>
</ol>

<p>
This looks a whole lot like what Postgres does. When you run <code>DROP TABLE</code>,
Postgres is going to lookup your permissions, look at your SQL, and then
determine if you&rsquo;re allowed to do that or not.
</p>
</div>
</div>
