src/org/content/dsql-auth.org
** Presigned requests

Remember how we talked about replay attacks? If you intercept a plaintext signed
request to an AWS service, then you can replay that request over and over? Well,
turns out there is a hidden feature in there.

[[https://docs.aws.amazon.com/AmazonS3/latest/userguide/ShareObjectPreSignedURL.html][Sharing objects with presigned URLs]] is a neat feature where you can sign a
request to download an object from S3 but, instead of making the request, you
just save the resulting URL. It looks like this:

#+begin_src sh :results raw
aws s3 presign s3://amzn-s3-demo-bucket/mydoc.txt --expires-in 604800
#+end_src

#+RESULTS:
https://amzn-s3-demo-bucket.s3.us-west-2.amazonaws.com/mydoc.txt?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=xxxx&X-Amz-Date=20250516T002102Z&X-Amz-Expires=604800&X-Amz-SignedHeaders=host&X-Amz-Signature=xxxx

This URL looks a lot like the HTTP request we saw earlier, except some of the
headers are now parameters.

What's super cool about this is you can share access to /specific/ objects
without sharing your actual credentials, and without requiring that the user who
consumes the link has an AWS SDK (or even knows what AWS is).

When you share the presigned URL, you need to be thoughtful about /how and
where/ you share it. Think back to actually making a request - we relied on TLS
to keep our request private. How will you keep your presigned URLs private?

I just want to briefly pause and explain a common misconception about presigned
URLs: /it's just cryptography./ The URL you just saw is for a /bucket I do not
have access to/, generated by /invalid AWS credentials/. Click it (I dare you!),
it's not going to do anything. I can presign a request for any bucket, for any
object, in any region, even if I'm stranded on a desert island with nothing but
my laptop, 1% battery, and the AWS CLI. When you presign a URL, there are
absolutely no network requests being made /to generate the signed URL/[fn:6].

** Logging in to a database

When we connect to a Postgres database, we're /authenticating/ ourselves via one
of the authentication methods, and then we're taking the =LOGIN= action, which
must be /authorized/.

Or, put another way, we're making a request to =LOGIN=. What if logging in to
the database was an AWS API instead of a Postgres action?

#+begin_src sh
aws dsql login --cluster-id aaaaaaaaaaaaaaaaaaaaaaaaaa --postgres-role my-application
#+end_src

That doesn't help you connect to the database - you're going to need a Postgres
client like =psql= to do that. But it is an interesting idea, because as we've
seen, AWS has a robust process for authentication and authorization. If we
/could/ treat logging in like an API call then we get to ditch passwords. We
wouldn't be sending a password, we'd be sending a signed request. And we now
know that signed requests are so much better. Signed requests don't contain a
password. Signed requests can't be used to generate other requests. Signed
requests automatically expire.

You've probably taken the next step already. If we can't make a HTTPS API call
to login, because we need to be using the Postgres wire protocol with an
existing Postgres client, then maybe we can do one of those presigned URL
thingies? And that's exactly what DSQL does.

