generated/dsql-auth.html
<div id="outline-container-orgd4e3bc8" class="outline-3">
<h3 id="orgd4e3bc8">Presigned requests</h3>
<div class="outline-text-3" id="text-orgd4e3bc8">
<p>
Remember how we talked about replay attacks? If you intercept a plaintext signed
request to an AWS service, then you can replay that request over and over? Well,
turns out there is a hidden feature in there.
</p>

<p>
<a href="https://docs.aws.amazon.com/AmazonS3/latest/userguide/ShareObjectPreSignedURL.html">Sharing objects with presigned URLs</a> is a neat feature where you can sign a
request to download an object from S3 but, instead of making the request, you
just save the resulting URL. It looks like this:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws s3 presign s3://amzn-s3-demo-bucket/mydoc.txt --expires-in <span style="color: #da8548; font-weight: bold;">604800</span>
</pre>
</div>
<p>
<a href="https://amzn-s3-demo-bucket.s3.us-west-2.amazonaws.com/mydoc.txt?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=xxxx&amp;X-Amz-Date=20250516T002102Z&amp;X-Amz-Expires=604800&amp;X-Amz-SignedHeaders=host&amp;X-Amz-Signature=xxxx">https://amzn-s3-demo-bucket.s3.us-west-2.amazonaws.com/mydoc.txt?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=xxxx&amp;X-Amz-Date=20250516T002102Z&amp;X-Amz-Expires=604800&amp;X-Amz-SignedHeaders=host&amp;X-Amz-Signature=xxxx</a>
</p>

<p>
This URL looks a lot like the HTTP request we saw earlier, except some of the
headers are now parameters.
</p>

<p>
What&rsquo;s super cool about this is you can share access to <i>specific</i> objects
without sharing your actual credentials, and without requiring that the user who
consumes the link has an AWS SDK (or even knows what AWS is).
</p>

<p>
When you share the presigned URL, you need to be thoughtful about <i>how and
where</i> you share it. Think back to actually making a request - we relied on TLS
to keep our request private. How will you keep your presigned URLs private?
</p>

<p>
I just want to briefly pause and explain a common misconception about presigned
URLs: <i>it&rsquo;s just cryptography.</i> The URL you just saw is for a <i>bucket I do not
have access to</i>, generated by <i>invalid AWS credentials</i>. Click it (I dare you!),
it&rsquo;s not going to do anything. I can presign a request for any bucket, for any
object, in any region, even if I&rsquo;m stranded on a desert island with nothing but
my laptop, 1% battery, and the AWS CLI. When you presign a URL, there are
absolutely no network requests being made <i>to generate the signed URL</i><sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>.
</p>
</div>
</div>
<div id="outline-container-org234d315" class="outline-3">
<h3 id="org234d315">Logging in to a database</h3>
<div class="outline-text-3" id="text-org234d315">
<p>
When we connect to a Postgres database, we&rsquo;re <i>authenticating</i> ourselves via one
of the authentication methods, and then we&rsquo;re taking the <code>LOGIN</code> action, which
must be <i>authorized</i>.
</p>

<p>
Or, put another way, we&rsquo;re making a request to <code>LOGIN</code>. What if logging in to
the database was an AWS API instead of a Postgres action?
</p>

<div class="org-src-container">
<pre class="src src-sh">aws dsql login --cluster-id aaaaaaaaaaaaaaaaaaaaaaaaaa --postgres-role my-application
</pre>
</div>

<p>
That doesn&rsquo;t help you connect to the database - you&rsquo;re going to need a Postgres
client like <code>psql</code> to do that. But it is an interesting idea, because as we&rsquo;ve
seen, AWS has a robust process for authentication and authorization. If we
<i>could</i> treat logging in like an API call then we get to ditch passwords. We
wouldn&rsquo;t be sending a password, we&rsquo;d be sending a signed request. And we now
know that signed requests are so much better. Signed requests don&rsquo;t contain a
password. Signed requests can&rsquo;t be used to generate other requests. Signed
requests automatically expire.
</p>

<p>
You&rsquo;ve probably taken the next step already. If we can&rsquo;t make a HTTPS API call
to login, because we need to be using the Postgres wire protocol with an
existing Postgres client, then maybe we can do one of those presigned URL
thingies? And that&rsquo;s exactly what DSQL does.
</p>
</div>
</div>
