src/org/content/dsql-auth.org
** Authentication tokens and Postgres

And so, this leads us to DSQL authentication tokens. They're just like presigned
URLs in S3. They're created by your SDK or CLI, and they're just a local
cryptographic operation. Here's an example:

#+begin_src sh :results raw
aws dsql generate-db-connect-admin-auth-token --hostname my-cluster-id --expires-in 60
#+end_src

#+RESULTS:
my-cluster-id/?Action=DbConnectAdmin&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=xxxx&X-Amz-Date=20250516T003940Z&X-Amz-Expires=60&X-Amz-SignedHeaders=host&X-Amz-Signature=xxxx

What's the point of this? Well, if you send an authentication token /instead of
a password/, then we're cooking. Then we have a way to authenticate you, without
you needing to use pesky, dangerous passwords:

1. client -> server: My name is =$user= and I'd like to login to =$dbname=
2. server -> client: Sure, tell me your password
3. client -> server: =$token=

Tokens are just signed requests. DSQL will validate the signature, and then we
know you're really you. Here's what it looks like in practice:

#+begin_src sh
PGPASSWORD=$(aws dsql generate-db-connect-admin-auth-token --hostname $my_cluster_endpoint)
psql --host $my_cluster_endpoint --user admin
#+end_src

I think this is super cool. Yes, you need to generate a token to connect, but
(really) think about the alternative. Passwords need to be rotated. So you're
going up against:

#+begin_src sh
PGPASSWORD=$(aws secrets-manager get-secret-value  ...) # your password vault here
psql --host $my_cluster_endpoint --user admin
#+end_src

In many cases, the traditional password based retrieval would require an API
call which may in turn have an associated cost or availability implication.
Generating a token is nearly free. It's fast, it's local. Every time you call an
AWS service, you're generating a token. It's been heavily optimized.

This technique wasn't invented by the DSQL team - it was invented by our friends
in RDS (see [[https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.IAMDBAuth.Connecting.html][Connecting to your DB instance using IAM authentication]]).

When we were designing DSQL, we started with the assumption that, like RDS, we
would support both password authentication and the authentication token variant
of password authentication. But the more we thought about it, the more we
realized we had an opportunity to significantly raise the security bar and
reduce overall complexity.

The first thing we did is remove the concept of a /master password/. In DSQL,
there simply is no master password. You don't have to generate one when you
create a cluster. You don't need to decide between writing it down on a napkin
or, /sigh/, doing the right thing and setting up automatic rotation. It's just a
step that's been removed. You /already/ needed AWS credentials to create the
cluster. Just use those same credentials to connect.

DSQL clusters always have a user named =admin=. This is your "root" user, it has
super powers. The way to login as admin is to generate an /admin token/ as shown
above. For other users, just generate a non-admin token. Remember, tokens are
just "APIs that haven't been called yet". The APIs are named:

- DbConnectAdmin
- DbConnect

After DSQL validates your token, it will proceed as any other AWS service does:

1. Lookup the policies for the authenticated caller
2. Look at the request
3. Evaluate whether the request should be allowed

If you're logging in as the user "admin", then you must have used the
DbConnectAdmin form, and you must have a policy that authorizes that action.
Here's what an example policy looks like:

#+begin_src json
{
  "Effect": "Allow",
  "Action": "dsql:DbConnectAdmin",
  "Resource": "arn:aws:dsql:us-east-1:123456789012:cluster/my-cluster"
}
#+end_src

The =admin= user is responsible for bootstrapping other users by creating
Postgres roles and authorizing use of those roles:

#+begin_src sh
postgres=> CREATE ROLE example WITH LOGIN;
postgres=> AWS IAM GRANT example TO 'arn:aws:iam::012345678912:role/example';
#+end_src

#+begin_src json
{
  "Effect": "Allow",
  "Action": "dsql:DbConnect",
  "Resource": "arn:aws:dsql:us-east-1:123456789012:cluster/my-cluster"
}
#+end_src

Take special note of the =GRANT= statement! This is a really important piece of
the puzzle. You need to explicitly state which IAM users and roles are allowed
in!

Connecting with the example role looks like:

#+begin_src sh
my_cluster_id=my-cluster-id
PGPASSWORD=$(aws dsql generate-db-connect-auth-token --hostname $my_cluster_id)
psql --host $my_cluster_id --user example
#+end_src

So, what's up with the two tokens? Why not just have one token? We intentionally
kept DbConnect and DbConnectAdmin as separate actions to keep policy management
as simple as possible. Consider the wildcard policy:

#+begin_src json
{
  "Effect": "Allow",
  "Action": "dsql:DbConnect",
  "Resource": "*"
}
#+end_src

This says that the caller may connect to any cluster. That's bad, right? No,
it's perfectly OK, and is actually what we were shooting for in our design.
Wildcard policies are simple. Simple works.

The reason this policy is safe is because of the =AWS IAM GRANT= statement shown
above. Logging into a DSQL cluster requires that DSQL service authorize the API
request to login (that's what the policy is for), but the cluster itself needs
to authorize the IAM entity. It's really straight forward to see who has access
to your cluster, because you can just look at the grants:

#+begin_src sh
postgres=> select * from sys.iam_pg_role_mappings;
 iam_oid |                  arn                   | pg_role_oid | pg_role_name | grantor_pg_role_oid | grantor_pg_role_name
---------+----------------------------------------+-------------+--------------+---------------------+----------------------
   26398 | arn:aws:iam::012345678912:role/example |       26396 | example      |               15579 | admin
(1 row)
#+end_src

Now it might make more sense as to why we need two verbs. Every cluster always
has an "admin" user, just like every Postgres database has some kind of root
user. We need a way to express this special case, and make sure that it's
really, really hard to accidentally grant admin privileges to a database.

