generated/dsql-auth.html
<div id="outline-container-org884b0c2" class="outline-3">
<h3 id="org884b0c2">Authentication tokens and Postgres</h3>
<div class="outline-text-3" id="text-org884b0c2">
<p>
And so, this leads us to DSQL authentication tokens. They&rsquo;re just like presigned
URLs in S3. They&rsquo;re created by your SDK or CLI, and they&rsquo;re just a local
cryptographic operation. Here&rsquo;s an example:
</p>

<div class="org-src-container">
<pre class="src src-sh">aws dsql generate-db-connect-admin-auth-token --hostname my-cluster-id --expires-in <span style="color: #da8548; font-weight: bold;">60</span>
</pre>
</div>
<p>
my-cluster-id/?Action=DbConnectAdmin&amp;X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=xxxx&amp;X-Amz-Date=20250516T003940Z&amp;X-Amz-Expires=60&amp;X-Amz-SignedHeaders=host&amp;X-Amz-Signature=xxxx
</p>

<p>
What&rsquo;s the point of this? Well, if you send an authentication token <i>instead of
a password</i>, then we&rsquo;re cooking. Then we have a way to authenticate you, without
you needing to use pesky, dangerous passwords:
</p>

<ol class="org-ol">
<li>client -&gt; server: My name is <code>$user</code> and I&rsquo;d like to login to <code>$dbname</code></li>
<li>server -&gt; client: Sure, tell me your password</li>
<li>client -&gt; server: <code>$token</code></li>
</ol>

<p>
Tokens are just signed requests. DSQL will validate the signature, and then we
know you&rsquo;re really you. Here&rsquo;s what it looks like in practice:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">PGPASSWORD</span>=$<span style="color: #51afef;">(</span>aws dsql generate-db-connect-admin-auth-token --hostname $<span style="color: #dcaeea;">my_cluster_endpoint</span><span style="color: #51afef;">)</span>
psql --host $<span style="color: #dcaeea;">my_cluster_endpoint</span> --user admin
</pre>
</div>

<p>
I think this is super cool. Yes, you need to generate a token to connect, but
(really) think about the alternative. Passwords need to be rotated. So you&rsquo;re
going up against:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">PGPASSWORD</span>=$<span style="color: #51afef;">(</span>aws secrets-manager get-secret-value  ...<span style="color: #51afef;">)</span> <span style="color: #5B6268;"># </span><span style="color: #5B6268;">your password vault here</span>
psql --host $<span style="color: #dcaeea;">my_cluster_endpoint</span> --user admin
</pre>
</div>

<p>
In many cases, the traditional password based retrieval would require an API
call which may in turn have an associated cost or availability implication.
Generating a token is nearly free. It&rsquo;s fast, it&rsquo;s local. Every time you call an
AWS service, you&rsquo;re generating a token. It&rsquo;s been heavily optimized.
</p>

<p>
This technique wasn&rsquo;t invented by the DSQL team - it was invented by our friends
in RDS (see <a href="https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.IAMDBAuth.Connecting.html">Connecting to your DB instance using IAM authentication</a>).
</p>

<p>
When we were designing DSQL, we started with the assumption that, like RDS, we
would support both password authentication and the authentication token variant
of password authentication. But the more we thought about it, the more we
realized we had an opportunity to significantly raise the security bar and
reduce overall complexity.
</p>

<p>
The first thing we did is remove the concept of a <i>master password</i>. In DSQL,
there simply is no master password. You don&rsquo;t have to generate one when you
create a cluster. You don&rsquo;t need to decide between writing it down on a napkin
or, <i>sigh</i>, doing the right thing and setting up automatic rotation. It&rsquo;s just a
step that&rsquo;s been removed. You <i>already</i> needed AWS credentials to create the
cluster. Just use those same credentials to connect.
</p>

<p>
DSQL clusters always have a user named <code>admin</code>. This is your &ldquo;root&rdquo; user, it has
super powers. The way to login as admin is to generate an <i>admin token</i> as shown
above. For other users, just generate a non-admin token. Remember, tokens are
just &ldquo;APIs that haven&rsquo;t been called yet&rdquo;. The APIs are named:
</p>

<ul class="org-ul">
<li>DbConnectAdmin</li>
<li>DbConnect</li>
</ul>

<p>
After DSQL validates your token, it will proceed as any other AWS service does:
</p>

<ol class="org-ol">
<li>Lookup the policies for the authenticated caller</li>
<li>Look at the request</li>
<li>Evaluate whether the request should be allowed</li>
</ol>

<p>
If you&rsquo;re logging in as the user &ldquo;admin&rdquo;, then you must have used the
DbConnectAdmin form, and you must have a policy that authorizes that action.
Here&rsquo;s what an example policy looks like:
</p>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #51afef;">"Effect"</span>: <span style="color: #98be65;">"Allow"</span>,
  <span style="color: #51afef;">"Action"</span>: <span style="color: #98be65;">"dsql:DbConnectAdmin"</span>,
  <span style="color: #51afef;">"Resource"</span>: <span style="color: #98be65;">"arn:aws:dsql:us-east-1:123456789012:cluster/my-cluster"</span>
}
</pre>
</div>

<p>
The <code>admin</code> user is responsible for bootstrapping other users by creating
Postgres roles and authorizing use of those roles:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">postgres</span>=&gt; CREATE ROLE example WITH LOGIN;
<span style="color: #dcaeea;">postgres</span>=&gt; AWS IAM GRANT example TO <span style="color: #98be65;">'arn:aws:iam::012345678912:role/example'</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #51afef;">"Effect"</span>: <span style="color: #98be65;">"Allow"</span>,
  <span style="color: #51afef;">"Action"</span>: <span style="color: #98be65;">"dsql:DbConnect"</span>,
  <span style="color: #51afef;">"Resource"</span>: <span style="color: #98be65;">"arn:aws:dsql:us-east-1:123456789012:cluster/my-cluster"</span>
}
</pre>
</div>

<p>
Take special note of the <code>GRANT</code> statement! This is a really important piece of
the puzzle. You need to explicitly state which IAM users and roles are allowed
in!
</p>

<p>
Connecting with the example role looks like:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">my_cluster_id</span>=my-cluster-id
<span style="color: #dcaeea;">PGPASSWORD</span>=$<span style="color: #51afef;">(</span>aws dsql generate-db-connect-auth-token --hostname $<span style="color: #dcaeea;">my_cluster_id</span><span style="color: #51afef;">)</span>
psql --host $<span style="color: #dcaeea;">my_cluster_id</span> --user example
</pre>
</div>

<p>
So, what&rsquo;s up with the two tokens? Why not just have one token? We intentionally
kept DbConnect and DbConnectAdmin as separate actions to keep policy management
as simple as possible. Consider the wildcard policy:
</p>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #51afef;">"Effect"</span>: <span style="color: #98be65;">"Allow"</span>,
  <span style="color: #51afef;">"Action"</span>: <span style="color: #98be65;">"dsql:DbConnect"</span>,
  <span style="color: #51afef;">"Resource"</span>: <span style="color: #98be65;">"*"</span>
}
</pre>
</div>

<p>
This says that the caller may connect to any cluster. That&rsquo;s bad, right? No,
it&rsquo;s perfectly OK, and is actually what we were shooting for in our design.
Wildcard policies are simple. Simple works.
</p>

<p>
The reason this policy is safe is because of the <code>AWS IAM GRANT</code> statement shown
above. Logging into a DSQL cluster requires that DSQL service authorize the API
request to login (that&rsquo;s what the policy is for), but the cluster itself needs
to authorize the IAM entity. It&rsquo;s really straight forward to see who has access
to your cluster, because you can just look at the grants:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">postgres</span>=&gt; select * from sys.iam_pg_role_mappings;
 iam_oid |                  arn                   | pg_role_oid | pg_role_name | grantor_pg_role_oid | grantor_pg_role_name
---------+----------------------------------------+-------------+--------------+---------------------+----------------------
   <span style="color: #da8548; font-weight: bold;">26398</span> | arn:aws:iam::012345678912:role/example |       <span style="color: #da8548; font-weight: bold;">26396</span> | example      |               <span style="color: #da8548; font-weight: bold;">15579</span> | admin
<span style="color: #51afef;">(</span><span style="color: #da8548; font-weight: bold;">1</span> row<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Now it might make more sense as to why we need two verbs. Every cluster always
has an &ldquo;admin&rdquo; user, just like every Postgres database has some kind of root
user. We need a way to express this special case, and make sure that it&rsquo;s
really, really hard to accidentally grant admin privileges to a database.
</p>
</div>
</div>
