src/org/content/dsql-auth.org
** Summary and takeaways

In DSQL, there are no passwords, ever. Instead, tokens are used to
/authenticate/ who is trying to connect. Authentication tokens are generated by
the AWS SDK using fast, local cryptography and sent over the wire to DSQL
(instead of a password). After verifying a token, DSQL will evaluate the calling
identity's attached IAM Policies to ensure they have access to the cluster and
that the database administrator has authorized that identity to login.

Compared to passwords, tokens are significantly more secure because they have a
shorter lifespan that passwords which are either rotated infrequently or not at
all. Tokens are also operationally simpler because, unlike a password, there is
no need to orchestrate rotations, or make API calls to retrieve the current
password.

By leveraging Postgres's /Password/ authentication, DSQL remains wire compatible
with Postgres. Existing clients, drivers and tools can simply use a token in
place of a password.

If you're having trouble getting your setup right, take a look at my article on
[[file:dsql-auth-troubleshooting.org][Troubleshooting problems with DSQL auth]].

** FAQs

*** How long does a token need to be valid for?

Tokens are used to /connect/. It is perfectly reasonable to generate a token
that expires in 1 second, connect, and then use that connection for an hour.

We recommend keeping token expiry as short as possible. The only requirement is
that the token is still valid (not expired) when it reaches DSQL. A few seconds
is usually more than enough time.

*** Should I cache and reuse tokens?

You can, but you almost certainly don't need to.

Consider an application using AWS DynamoDB doing many thousands of requests per
second per host. Every single one of those requests is an AWS API call to
DynamoDB =GetItem= or =PutItem=. Every single one of those requests is signed by
the AWS SDK. And, signing those requests is /more expensive/ than generating a
DSQL token (because the requests simply have more bytes in them to process).

Token generation is /fast/, and is only used to /connect/. If you're running out
of CPU making tokens, something has gone horribly wrong, and caching isn't going
to help you.

*** Is token generation really a local operation?

I get this question all the time, because nearly everything in the AWS SDK is
about calling APIs. But, I promise you, /generating/ a presigned S3 URL or a RDS
or DSQL token involves nothing but CPU cycles.

"But, but, but!"" you say. Generating a token using the AWS SDK for Rust looks
like this:

#+begin_src rust
let token = signer.db_connect_admin_auth_token(&sdk_config).await?;
#+end_src

Why is there =await= there? Why is this cryptographic function using =async=?

[[https://journal.stuffwithstuff.com/2015/02/01/what-color-is-your-function/][What Color is Your Function?]] is the answer to this mystery. You see, if you dig
into what that function does, you'll find that it needs credentials to do the
signing. Credentials are provided by credentials providers (!), and that's a
generic thing, and so it lands up being =async= because some of the providers
need to make network requests.

When you're running code in an environment that automatically provides
credentials (like EC2 or Lambda), the SDK will pick up credentials from that
environment by making a network request. This request doesn't go out over the
network, it just needs to leave your virtualized guest. Loading these
credentials is fast, local, reliable, and happens infrequently (the vended
credentials are valid for several hours).

*** When using RDS with the IAM plugin, my connection rate is limited. Does the same limit apply to DSQL?

No, it doesn't, due to architectural differences.

DSQL does have various limits and quotas, including a quota on how many new
connections you can open per second. This quota is quite generous by default,
and can be increased through the service quotas page. The connection rate quota
is /not a consequence/ of authentication tokens.

*** But when I generate a token with the AWS CLI it takes 0.5ms! That's slow!

I agree, but it's not /token generation/ that's slow. It's the CLI that's slow.
The AWS CLI is a fairly large Python application. Running

#+begin_src sh
aws dsql generate-db-connect-admin-auth-token --hostname ...
#+end_src

is 99.999% about starting the AWS CLI. The actual token generation is /very
fast/.

If, for some reason, you find yourself in a busy loop in a shell script
generating tokens, consider either caching tokens, or use a less generic tool
such as the token generator in [[https://github.com/marcbowes/aws-dsql-auth][aws-dsql-auth]].

* Footnotes
[fn:1] A running Postgres server configured to host one or more databases.

[fn:2] In Postgres, a /role/ and a /user/ are synonyms. Postgres typically uses
/user/ for the authentication phase and /role/ everywhere else.

[fn:3] Aren't we talking about authentication now? Yes. Yes, we are. I do not
know why [[https://datatracker.ietf.org/doc/html/rfc7235][RFC 7235]] ("HTTP/1.1 Authentication") is so confused on the matter.

[fn:4] A real request will have additional headers. I've left those out to keep
this explanation as simple as possible.

[fn:5] Or similar time-based expiry mechanism.

[fn:6] I'm going to pedantically expand on this later.
