generated/dsql-auth.html
<div id="outline-container-org9d403aa" class="outline-3">
<h3 id="org9d403aa">Summary and takeaways</h3>
<div class="outline-text-3" id="text-org9d403aa">
<p>
In DSQL, there are no passwords, ever. Instead, tokens are used to
<i>authenticate</i> who is trying to connect. Authentication tokens are generated by
the AWS SDK using fast, local cryptography and sent over the wire to DSQL
(instead of a password). After verifying a token, DSQL will evaluate the calling
identity&rsquo;s attached IAM Policies to ensure they have access to the cluster and
that the database administrator has authorized that identity to login.
</p>

<p>
Compared to passwords, tokens are significantly more secure because they have a
shorter lifespan that passwords which are either rotated infrequently or not at
all. Tokens are also operationally simpler because, unlike a password, there is
no need to orchestrate rotations, or make API calls to retrieve the current
password.
</p>

<p>
By leveraging Postgres&rsquo;s <i>Password</i> authentication, DSQL remains wire compatible
with Postgres. Existing clients, drivers and tools can simply use a token in
place of a password.
</p>

<p>
If you&rsquo;re having trouble getting your setup right, take a look at my article on
<a href="dsql-auth-troubleshooting.html">Troubleshooting problems with DSQL auth</a>.
</p>
</div>
</div>
<div id="outline-container-org0daf769" class="outline-3">
<h3 id="org0daf769">FAQs</h3>
<div class="outline-text-3" id="text-org0daf769">
</div>
<div id="outline-container-orgaea967f" class="outline-4">
<h4 id="orgaea967f">How long does a token need to be valid for?</h4>
<div class="outline-text-4" id="text-orgaea967f">
<p>
Tokens are used to <i>connect</i>. It is perfectly reasonable to generate a token
that expires in 1 second, connect, and then use that connection for an hour.
</p>

<p>
We recommend keeping token expiry as short as possible. The only requirement is
that the token is still valid (not expired) when it reaches DSQL. A few seconds
is usually more than enough time.
</p>
</div>
</div>
<div id="outline-container-orgf667e22" class="outline-4">
<h4 id="orgf667e22">Should I cache and reuse tokens?</h4>
<div class="outline-text-4" id="text-orgf667e22">
<p>
You can, but you almost certainly don&rsquo;t need to.
</p>

<p>
Consider an application using AWS DynamoDB doing many thousands of requests per
second per host. Every single one of those requests is an AWS API call to
DynamoDB <code>GetItem</code> or <code>PutItem</code>. Every single one of those requests is signed by
the AWS SDK. And, signing those requests is <i>more expensive</i> than generating a
DSQL token (because the requests simply have more bytes in them to process).
</p>

<p>
Token generation is <i>fast</i>, and is only used to <i>connect</i>. If you&rsquo;re running out
of CPU making tokens, something has gone horribly wrong, and caching isn&rsquo;t going
to help you.
</p>
</div>
</div>
<div id="outline-container-org4fd7cb8" class="outline-4">
<h4 id="org4fd7cb8">Is token generation really a local operation?</h4>
<div class="outline-text-4" id="text-org4fd7cb8">
<p>
I get this question all the time, because nearly everything in the AWS SDK is
about calling APIs. But, I promise you, <i>generating</i> a presigned S3 URL or a RDS
or DSQL token involves nothing but CPU cycles.
</p>

<p>
&ldquo;But, but, but!&rdquo;" you say. Generating a token using the AWS SDK for Rust looks
like this:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">let</span> <span style="color: #dcaeea;">token</span> = signer.db_connect_admin_auth_token<span style="color: #51afef;">(</span><span style="color: #bbc2cf; background-color: #282c34;">&amp;</span>sdk_config<span style="color: #51afef;">)</span>.<span style="color: #51afef;">await</span><span style="color: #c678dd; font-weight: bold;">?</span>;
</pre>
</div>

<p>
Why is there <code>await</code> there? Why is this cryptographic function using <code>async</code>?
</p>

<p>
<a href="https://journal.stuffwithstuff.com/2015/02/01/what-color-is-your-function/">What Color is Your Function?</a> is the answer to this mystery. You see, if you dig
into what that function does, you&rsquo;ll find that it needs credentials to do the
signing. Credentials are provided by credentials providers (!), and that&rsquo;s a
generic thing, and so it lands up being <code>async</code> because some of the providers
need to make network requests.
</p>

<p>
When you&rsquo;re running code in an environment that automatically provides
credentials (like EC2 or Lambda), the SDK will pick up credentials from that
environment by making a network request. This request doesn&rsquo;t go out over the
network, it just needs to leave your virtualized guest. Loading these
credentials is fast, local, reliable, and happens infrequently (the vended
credentials are valid for several hours).
</p>
</div>
</div>
<div id="outline-container-orgee3483f" class="outline-4">
<h4 id="orgee3483f">When using RDS with the IAM plugin, my connection rate is limited. Does the same limit apply to DSQL?</h4>
<div class="outline-text-4" id="text-orgee3483f">
<p>
No, it doesn&rsquo;t, due to architectural differences.
</p>

<p>
DSQL does have various limits and quotas, including a quota on how many new
connections you can open per second. This quota is quite generous by default,
and can be increased through the service quotas page. The connection rate quota
is <i>not a consequence</i> of authentication tokens.
</p>
</div>
</div>
<div id="outline-container-orgce906cd" class="outline-4">
<h4 id="orgce906cd">But when I generate a token with the AWS CLI it takes 0.5ms! That&rsquo;s slow!</h4>
<div class="outline-text-4" id="text-orgce906cd">
<p>
I agree, but it&rsquo;s not <i>token generation</i> that&rsquo;s slow. It&rsquo;s the CLI that&rsquo;s slow.
The AWS CLI is a fairly large Python application. Running
</p>

<div class="org-src-container">
<pre class="src src-sh">aws dsql generate-db-connect-admin-auth-token --hostname ...
</pre>
</div>

<p>
is 99.999% about starting the AWS CLI. The actual token generation is <i>very
fast</i>.
</p>

<p>
If, for some reason, you find yourself in a busy loop in a shell script
generating tokens, consider either caching tokens, or use a less generic tool
such as the token generator in <a href="https://github.com/marcbowes/aws-dsql-auth">aws-dsql-auth</a>.
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A running Postgres server configured to host one or more databases.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
In Postgres, a <i>role</i> and a <i>user</i> are synonyms. Postgres typically uses
<i>user</i> for the authentication phase and <i>role</i> everywhere else.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Aren&rsquo;t we talking about authentication now? Yes. Yes, we are. I do not
know why <a href="https://datatracker.ietf.org/doc/html/rfc7235">RFC 7235</a> (&ldquo;HTTP/1.1 Authentication&rdquo;) is so confused on the matter.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A real request will have additional headers. I&rsquo;ve left those out to keep
this explanation as simple as possible.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Or similar time-based expiry mechanism.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I&rsquo;m going to pedantically expand on this later.
</p></div></div>


</div>
</div></div>
</body>
</html>
